IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

           DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 CHOICE1 PIC X(1).
           01 CHOICE2 PIC X(1).
           01 CHOICE3 PIC X(1).
           01 USERNUM1 PIC 9(16).
           01 USERNUM2 PIC 9(16).
           01 PIN1 PIC 9(6).
           01 PIN2 PIC 9(6).
           
           PROCEDURE DIVISION.
           
           DISPLAY "-----PRESS THE NUMBER OF YOUR CARD CLASSIFICATION-----"
           DISPLAY "1. CREDIT CARD".
           DISPLAY "2. DEBIT CARD".
           DISPLAY "3. EXIT".
           DISPLAY "-> " CHOICE1.
            ACCEPT CHOICE1.
            
           IF CHOICE1 = 2 THEN
                     DISPLAY "-----PRESS THE NUMBER OF YOUR TRANSACTION-----"
                     DISPLAY "1. INSERT CARD/INPUT CARD NUMBER".
                     DISPLAY "2. EXIT".
                     DISPLAY "->: " CHOICE2.
                      ACCEPT CHOICE2.
              IF CHOICE2 = 1 THEN 
                     DISPLAY "SKIMMER IS UNDETECTED OR IS UNAVAILABLE".
                     DISPLAY "PLEASE INPUT YOUR CARD NUMBER: " USERNUM1.
                      ACCEPT USERNUM1.
                     DISPLAY "PLEASE INPUT YOUR 6-DIGIT PIN: " PIN1.
                      ACCEPT PIN1.
                            IF (USERNUM1 = 1234567890123456) AND (PIN1 = 123456) THEN
                                   DISPLAY "HELLO DEBIT"
                            ELSE
                                   DISPLAY "SORRY, INCORRECT CREDENTIALS. GOODBYE."
                                   STOP RUN.
                            END IF.
              END IF.
              IF CHOICE2 = 2 THEN
                     DISPLAY "GOODBYE!".
                     STOP RUN.
              END IF.
           END IF.

           IF CHOICE1 = 1 THEN 
               DISPLAY "-----PRESS THE NUMBER OF YOUR TRANSACTION-----"
                     DISPLAY "1. INSERT CARD/INPUT CARD NUMBER".
                     DISPLAY "2. EXIT".
                     DISPLAY "->: " CHOICE3.
                      ACCEPT CHOICE3.
              IF CHOICE2 = 1 THEN 
                     DISPLAY "SKIMMER IS UNDETECTED OR IS UNAVAILABLE".
                     DISPLAY "PLEASE INPUT YOUR CARD NUMBER: " USERNUM2.
                      ACCEPT USERNUM2.
                     DISPLAY "PLEASE INPUT YOUR 6-DIGIT PIN: " PIN2.
                      ACCEPT PIN2.
                            IF (USERNUM2 = 65432210987654321) AND (PIN1 = 654321) THEN
                                   DISPLAY "HELLO CREDIT"
                            ELSE
                                   DISPLAY "SORRY, INCORRECT CREDENTIALS. GOODBYE."
                                   STOP RUN.
                            END IF.
              END IF.
              IF CHOICE3 = 2 THEN
                     DISPLAY "GOODBYE!".
                     STOP RUN.
              END IF.
           END IF.
           STOP RUN.
