      ******************************************************************
      * Author: GROUP 6
      * Date: FEB 2022
      * Purpose: COMPROG3 FINAL PROJECT
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ATM_SYSTEM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 CHOICE1 PIC X(1).
           01 CHOICE2 PIC X(1).
           01 CHOICE3 PIC X(1).
           01 USERNUM1 PIC 9(16).
           01 USERNUM2 PIC 9(16).
           01 PIN1 PIC 9(6).
           01 PIN2 PIC 9(6).
           
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "***PLEASE INPUT THE NUMBER OF YOUR CHOICE***"
           DISPLAY "1. CREDIT CARD"
           DISPLAY "2. DEBIT CARD"
           DISPLAY "3. EXIT"
           DISPLAY "-> "
            ACCEPT CHOICE1
           
           EVALUATE TRUE
               WHEN CHOICE1 = "2"
                DISPLAY "***PRESS THE NUMBER OF YOUR TRANSACTION***"
                DISPLAY "1. INPUT CARD NUMBER"
                DISPLAY "2. EXIT"
                DISPLAY "-> "
                 ACCEPT CHOICE3
               WHEN CHOICE1 = "3"
                EXIT
               WHEN OTHER
                DISPLAY "INVALID USER INPUT"
           END-EVALUATE
           
               EVALUATE TRUE  
                  WHEN CHOICE3 = "1"
                   DISPLAY "*SKIMMER IS UNDETECTED OR IS UNAVAILABLE*"
                   DISPLAY "***PLEASE INPUT YOUR CARD NUMBER***"
                    ACCEPT USERNUM2
                   DISPLAY "***PLEASE INPUT YOUR 6-DIGIT PIN***"
                    ACCEPT PIN2 
                   EVALUATE TRUE
                    WHEN USERNUM2="1234567890123456" AND PIN2="123456"
                     DISPLAY "*HELLO DEBIT*"
                    WHEN USERNUM2 IS NOT= "1234567890123456" AND PIN2 IS NOT= "123456"
                     DISPLAY "*SORRY, INCORRECT CREDENTIALS. GOODBYE*"
                     EXIT
                   
                  WHEN CHOICE3 = "2"
                   DISPLAY "GOODBYE"
                   EXIT
                   
                  WHEN CHOICE3 IS NOT= "1" OR "2" OR "3"
                   DISPLAY "INVALID USER INPUT"
                   EXIT
               END-EVALUATE
               
           STOP RUN.
           
       END PROGRAM ATM_SYSTEM.

